/**
########################################################################
#
# Copyright (c) 2025 xx.com, Inc. All Rights Reserved
#
########################################################################
# Author : xuechengyun
# E-mail : xuechengyun@gmail.com
# Date   : 2025/06/03 16:01:11
# Desc   : 第 4 章 元编程介绍
########################################################################
*/

// 4.1 元编程历史
// 4.2 模板历史
// 4.3 constexpr 历史
// 4.4 元编程能力与应用
// 4.4.1 零成本抽象
// 4.4.2 值计算: 编译时进行值计算，使用 constexpr
// 4.4.3 类型计算
// 4.4.4 编译时多态
// 4.4.5 类型安全
// 4.4.6 泛型编程
// 4.4.7 静态反射
// 4.4.8 内部领域特定语言 EDSL
int main() {

  return 0;
}



